ririyeye/co_mcu/bsp/Firmware/gd32e11_script/GD32E11x.svd
        <register>
          <name>IDATA0</name>
          <displayName>IDATA0</displayName>
          <description>Inserted data register 0</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDATAn</name>
              <description>Inserted number n conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATA1</name>
          <displayName>IDATA1</displayName>
          <description>Inserted data register 1</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDATAn</name>
              <description>Inserted number n conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATA2</name>
          <displayName>IDATA2</displayName>
          <description>Inserted data register 2</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDATAn</name>
              <description>Inserted number n conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATA3</name>
          <displayName>IDATA3</displayName>
          <description>Inserted data register 3</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDATAn</name>
              <description>Inserted number n conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATA</name>
          <displayName>RDATA</displayName>
          <description>regular data register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATA</name>
              <description>Regular channel data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OVSAMPCTL</name>
          <displayName>OVSAMPCTL</displayName>
          <description>Oversample control register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
          <field>
              <name>DRES</name>
              <description>ADC resolution</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TOVS</name>
              <description>Triggered Oversampling</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVSS</name>
              <description>Oversampling shift</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>OVSR</name>
              <description>Oversampling ratio</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OVSEN</name>
              <description>Oversampling Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       </registers>
    </peripheral>
    <peripheral>
      <name>AFIO</name>
      <description>Alternate-function I/Os</description>
      <groupName>AFIO</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EC</name>
          <displayName>EC</displayName>
          <description>Event control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EOE</name>
              <description>Event output enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PORT</name>
              <description>Event output port selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PIN</name>
              <description>Event output pin selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCF0</name>
          <displayName>PCF0</displayName>
          <description>AFIO port configuration register 0</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMER1ITR0_REMAP</name>
              <description>TIMER1 internal trigger 0 remapping</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI2_REMAP</name>
              <description>SPI2/I2S2 remapping</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWJ_CFG</name>
              <description>Serial wire JTAG configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CAN1_REMAP</name>
              <description>CAN1 I/O remapping</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>TIMER4CH3_IREMAP</name>
              <description>TIMER4 channel3 internal remapping</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD01_REMAP</name>
              <description>Port D0/Port D1 mapping on OSC_IN/OSC_OUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAN0_REMAP</name>
              <description>CAN0 alternate interface remapping</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMER3_REMAP</name>
              <description>TIMER3 remapping</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER2_REMAP</name>
              <description>TIMER2 remapping</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMER1_REMAP</name>
              <description>TIMER1 remapping</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMER0_REMAP</name>
              <description>TIMER0 remapping</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>USART2_REMAP</name>
              <description>USART2 remapping</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>USART1_REMAP</name>
              <description>USART1 remapping</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART0_REMAP</name>
              <description>USART0 remapping</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C0_REMAP</name>
              <description>I2C0 remapping</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI0_REMAP</name>
              <description>SPI0 remapping</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS0</name>
          <displayName>EXTISS0</displayName>
          <description>EXTI sources selection register 0</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI3_SS</name>
              <description>EXTI 3 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
          </field>
           <field>
              <name>EXTI2_SS</name>
              <description>EXTI 2 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
          </field>
            <field>
              <name>EXTI1_SS</name>
              <description>EXTI 1 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
          </field>
            <field>
              <name>EXTI0_SS</name>
              <description>EXTI 0 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS1</name>
          <displayName>EXTISS1</displayName>
          <description>EXTI sources selection register 1</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI7_SS</name>
              <description>EXTI 7 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI6_SS</name>
              <description>EXTI 6 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI5_SS</name>
              <description>EXTI 5 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI4_SS</name>
              <description>EXTI 4 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS2</name>
          <displayName>EXTISS2</displayName>
          <description>EXTI sources selection register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI11_SS</name>
              <description>EXTI 11 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI10_SS</name>
              <description>EXTI 10 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI9_SS</name>
              <description>EXTI 9 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI8_SS</name>
              <description>EXTI 8 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS3</name>
          <displayName>EXTISS3</displayName>
          <description>EXTI sources selection register 3</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI15_SS</name>
              <description>EXTI 15 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI14_SS</name>
              <description>EXTI 14 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI13_SS</name>
              <description>EXTI 13 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI12_SS</name>
              <description>EXTI 12 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCF1</name>
          <displayName>PCF1</displayName>
          <description>AFIO port configuration register 1</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTC_REMAP</name>
              <description>CTC remapping</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXMC_NADV</name>
              <description>EXMC_NADV connect/disconnect</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER8_REMAP</name>
              <description>TIMER8 remapping</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPSCTL</name>
          <displayName>CPSCTL</displayName>
          <description>IO compensation control register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPS_RDY</name>
              <description>I/O compensation cell is really or not</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPS_EN</name>
              <description>I/O compensation cell enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
